#+EXPORT_FILE_NAME: ../../episodes/python_scripts.md
#+OPTIONS: toc:nil author:nil date:nil num:nil title:nil
#+MACRO: mdheader @@markdown:$1@@
#+PROPERTY: header-args:python :session onePy :results output :exports both :cache yes :wrap src python

#+begin_export markdown
---
title: "Writing Reproducible Python"
teaching: 20
exercises: 10
---
#+end_export

#+begin_questions
- What is the difference between the standard library and third-party packages?
- How do I share a script so that it runs on someone else's computer?
#+end_questions

#+begin_objectives
- Import and use the =pathlib= standard library.
- Identify when a script requires external dependencies (like =numpy=).
- Write a self-contained script that declares its own dependencies using inline metadata.
- Share a script which reproducibly handles =conda= dependencies alongside Python.
#+end_objectives

* The Humble Script

Most research software starts as a single file. You have some data, you need to
analyze it, and you write a sequence of commands to get the job done.

Let's start by creating a script that generates some data and saves it.
We will use the standard library module =pathlib= to handle file paths safely
across operating systems (Windows/macOS/Linux).

#+begin_src python :tangle data/generate_data.py
import random
from pathlib import Path

# Define output directory
DATA_DIR = Path("data")
DATA_DIR.mkdir(exist_ok=True)

def generate_trajectory(n_steps=100):
    print(f"Generating trajectory with {n_steps} steps...")
    path = [0.0]
    for _ in range(n_steps):
        # Random walk step
        step = random.uniform(-0.5, 0.5)
        path.append(path[-1] + step)
    return path

if __name__ == "__main__":
    traj = generate_trajectory()
    output_file = DATA_DIR / "trajectory.txt"
    
    with open(output_file, "w") as f:
        for point in traj:
            f.write(f"{point}\n")
    
    print(f"Saved to {output_file}")
#+end_src

#+RESULTS[55e680b58b7d139bd83520a7ac787060efd60a94]:
#+begin_src python
Generating trajectory with 100 steps...
Saved to data/trajectory.txt
#+end_src

#+begin_src
head -n 3 data/trajectory.txt
#+end_src

#+RESULTS:
|                 0.0 |
| 0.26061738860297956 |
|  0.3579801208269566 |

This script uses only *Built-in* modules (=random=, =pathlib=). You can send
this file to anyone with Python installed, and it will run.

